# GetAllConnectedLevels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..GetAllConnectedLevels Method
MultistoryStairs Class See Also
---
Gets all connected level ids of this multistory stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ISet<ElementId> GetAllConnectedLevels()
```

Visual Basic
---
```text
Public Function GetAllConnectedLevels As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAllConnectedLevels()
```

# ### Return Value
The ids of connected levels.
# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace